app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
---
SELECT `customers`.* FROM `customers`

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`name`, `city`, `created_at`, `updated_at`) VALUES ('Lucas', 'Sao Paulo', '2016-12-12 22:14:51', '2016-12-12 22:14:51')

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1